<!DOCTYPE html>
<html lang="es">
<head>
  <meta name="viewport" content="width=device-width, initial-scale=1">
	<meta charset="utf-8">
	<title>portafolio web</title>
  <link href="styles.css" rel= "stylesheet">
	<link href="https://cdn.jsdelivr.net/npm/bootstrap@5.1.1/dist/css/bootstrap.min.css" rel="stylesheet" integrity="sha384-F3w7mX95PdgyTmZZMECAngseQB83DfGTowi0iMjiWaeVhAn4FJkqJByhZMI3AhiU" crossorigin="anonymous">
</head>
<body>
	
	<nav class="navbar navbar-expand-lg navbar-light bg-light">
  <div class="container-fluid">
    <a class="navbar-brand" href="#">Portafolio</a>
    <button class="navbar-toggler" type="button" data-bs-toggle="collapse" data-bs-target="#navbarNavAltMarkup" aria-controls="navbarNavAltMarkup" aria-expanded="false" aria-label="Toggle navigation">
      <span class="navbar-toggler-icon"></span>
    </button>
    <div class="collapse navbar-collapse" id="navbarNavAltMarkup">
      <div class="navbar-nav">
        <a class="nav-link active" aria-current="page" href="index.html">Home</a>
        <a class="nav-link" href="segundoparcial.html">Segundo parcial</a>
        <a class="nav-link" href="3er parcialHW.html"><b>Tercer Parcial</b></a>
      </div>
      <div class="container px-4">
  <div class="row gx-5">
    <div class="col">
     <div class="p-3 border bg-light">Victor Manuel M.</div>


    
    </div>
  </div>
</div>
    </div>
  </div>
</nav>
	<a  href= aplicaciones.html class="btn btn-primary"> PDF </a>
  <h1><center>Aplicaciones web favoritas</center></h1>



<p style="text-align: justify;"><span style="text-decoration: underline;"><em><strong>Instagram:</strong></em></span> (com&uacute;nmente abreviado como IG o Insta) es una aplicaci&oacute;n y red social de origen estadounidense, propiedad de Facebook, cuya funci&oacute;n principal es poder compartir fotograf&iacute;as y v&iacute;deos con otros usuarios. Est&aacute; disponible para dispositivos Android, iOS y Windows 10.</p>
<p style="text-align: justify;">Creada por Kevin Systrom y Mike Krieger, Instagram fue lanzada el 6 de octubre de 2010. Esta aplicaci&oacute;n gan&oacute; r&aacute;pidamente popularidad, llegando a tener m&aacute;s de 100 millones de usuarios activos en abril de 2012 y m&aacute;s de 300 millones en diciembre de 2014. Instagram fue dise&ntilde;ada originariamente para iPhone y a su vez est&aacute; disponible para sus hermanos iPad y iPod con el sistema iOS 3.0.2 o superior. A principios de abril de 2012, se public&oacute; una versi&oacute;n para Android, y en 2013 se lanz&oacute; la versi&oacute;n beta para Windows Phone y oficial para Windows 10 en 2016.</p>
<p style="text-align: justify;">Instagram tambi&eacute;n posee un medio de comunicaci&oacute;n privado para hablar llamado Instagram Direct, y una funci&oacute;n llamada Historias (en ingl&eacute;s, Stories) donde todas las personas pueden publicar fotograf&iacute;as y v&iacute;deos temporales a su perfil, agregando variados filtros y efectos, con una duraci&oacute;n m&aacute;xima de permanencia de 24 horas; que tambi&eacute;n se pueden guardar en el perfil permanentemente para que puedan ser vistos, como &laquo;Historias destacadas&raquo;. Esta caracter&iacute;stica tambi&eacute;n permite a los usuarios una funci&oacute;n de videos en directo, que tambi&eacute;n pueden ser guardados para ver con posterioridad y a trav&eacute;s de los que pueden interactuar con otros seguidores; compartir gifs; crear y editar reels e incluso hacer videollamada, una funci&oacute;n muy utilizada por los usuarios.</p>
<p style="text-align: justify;">Seg&uacute;n datos de DataReportal en enero de 2020 Instagram era la sexta red social m&aacute;s utilizada a nivel mundial, con alrededor de 1000 millones de usuarios activos mensuales. A septiembre de 2020, la cuenta con m&aacute;s seguidores es la propia de Instagram, con m&aacute;s de 365 millones de seguidores. El hombre m&aacute;s seguido es el futbolista portugu&eacute;s Cristiano Ronaldo con m&aacute;s de 300 millones de seguidores, mientras que la mujer m&aacute;s seguida es la cantante estadounidense Ariana Grande con m&aacute;s de 266 millones de seguidores.</p>
<p style="text-align: justify;"><strong>HISTORIA:</strong></p>
<p style="text-align: justify;">El desarrollo de Instagram se inici&oacute; en San Francisco, cuando Kevin Systrom y Mike Krieger optaron por centrar sus m&uacute;ltiples funciones HTML5 check-in Burbn en un proyecto de fotograf&iacute;a m&oacute;vil. El producto fue lanzado en el Apple App Store el 6 de octubre de 2010 bautizado como Instagram.</p>
<p style="text-align: justify;">Poco despu&eacute;s del lanzamiento, Josh Riedel se uni&oacute; al equipo como Gerente de la Comunidad. Shayne Sweeney se uni&oacute; al equipo en noviembre de 2010 como ingeniero y Jessica Zollman fue contratada como encargada de promoci&oacute;n en agosto de 2011.</p>
<p style="text-align: justify;">En el mes de enero de 2011, Instagram a&ntilde;adi&oacute; hashtags para ayudar a los usuarios a descubrir las fotos que los dem&aacute;s usuarios compart&iacute;an sobre un mismo tema. Instagram animaba as&iacute; a sus usuarios a a&ntilde;adir hashtags relevantes y espec&iacute;ficos, en lugar de etiquetar palabras como foto con el objetivo de hacer las fotograf&iacute;as m&aacute;s populares, atraer a un mayor n&uacute;mero de fan&aacute;ticos y conseguir m&aacute;s me gusta.</p>
<p style="text-align: justify;">En septiembre de 2011, la versi&oacute;n 2.0 se puso en marcha en la App Store. Se incluyeron nuevos filtros en vivo, opci&oacute;n de aplicar efectos de desenfoque a &aacute;reas concretas, edici&oacute;n de im&aacute;genes de alta resoluci&oacute;n, bordes opcionales, bot&oacute;n de rotaci&oacute;n de la imagen y un bot&oacute;n de actualizaci&oacute;n.</p>
<p style="text-align: justify;">El 3 de abril de 2012 sali&oacute; la versi&oacute;n abierta al p&uacute;blico para Android. Algunas semanas antes, Instagram hab&iacute;a anunciado que estaba llevando a cabo pruebas en Android mediante una beta cerrada. En dicho momento, se dio la posibilidad de registrarse en una web para recibir un aviso una vez fuera lanzada la aplicaci&oacute;n final, lo cual hicieron unas 430 000 personas. Una vez lanzada, la versi&oacute;n para Android consigui&oacute; m&aacute;s de un mill&oacute;n de descargas en menos de 24 horas. En los tres meses siguientes Instagram fue evaluado m&aacute;s de un mill&oacute;n de veces por los usuarios de Google Play, convirti&eacute;ndose de esta forma en la quinta aplicaci&oacute;n m&aacute;s evaluada por dichos usuarios en mayo de 2013, la aplicaci&oacute;n hab&iacute;a sido evaluada m&aacute;s de 4 millones de veces. Asimismo, se liber&oacute; la API de la aplicaci&oacute;n permitiendo a terceros crear sus propias apps las cuales incluyesen los servicios de Instagram como Instamaps, Instahood o Instaweather.</p>
<p style="text-align: justify;">El 9 de abril de 2012, se anunci&oacute; que Facebook hab&iacute;a adquirido la compa&ntilde;&iacute;a por mil millones de USD.10</p>
<p style="text-align: justify;">A partir de la versi&oacute;n 4.0 la aplicaci&oacute;n permite al usuario la toma de v&iacute;deos con una duraci&oacute;n m&aacute;xima de 1 minuto. Esta nueva herramienta incluye estabilizaci&oacute;n de imagen.</p>
<p style="text-align: justify;">El 17 de diciembre de 2012, Instagram actualiz&oacute; sus t&eacute;rminos de privacidad y condiciones de uso, otorg&aacute;ndose as&iacute; el derecho a vender las fotos de los usuarios a terceros sin notificaci&oacute;n o compensaci&oacute;n a partir del 16 de enero de 2013. La cr&iacute;tica de los defensores de la privacidad, los consumidores, National Geographic y celebridades como Kim Kardashian llev&oacute; a Instagram a deshacer los cambios impuestos en la declaraci&oacute;n de los t&eacute;rminos de privacidad. Aun as&iacute;, Instagram perdi&oacute; gran parte de usuarios, que optaron por cambiarse a otros servicios similares a Instagram. Instagram est&aacute; trabajando actualmente en el desarrollo de un nuevo texto para reemplazar los t&eacute;rminos controvertidos.</p>
<p style="text-align: justify;">El 2 de mayo de 2013, Instagram introdujo la posibilidad de etiquetar a personas y marcas en cualquiera de las fotos. De esta forma, satisfac&iacute;a una de las caracter&iacute;sticas m&aacute;s demandadas por los usuarios. El 12 de diciembre de ese mismo a&ntilde;o integr&oacute; Instagram Direct, es la forma de enviar mensajes directos y privados con fotograf&iacute;as o v&iacute;deos, tal como los mensajes de Facebook.</p>
<p style="text-align: justify;">En 2014, Windows Phone empez&oacute; a contar con la aplicaci&oacute;n en fase beta, pudiendo utilizar todas sus funciones excepto la de subir v&iacute;deos.1 Mientras en Windows 10 Mobile ya se encuentra la versi&oacute;n completa de la aplicaci&oacute;n, luego de estar tanto tiempo en versi&oacute;n beta.</p>
<p style="text-align: justify;">En 2015 se incorpor&oacute; la posibilidad de pautar publicidad desde la plataforma de avisos de Facebook para y en Instagram.</p>
<p style="text-align: justify;">En mayo de 2016, Instagram renueva su logotipo, dejando la caracter&iacute;stica c&aacute;mara vintage por un dise&ntilde;o m&aacute;s colorido, es simplemente una c&aacute;mara detr&aacute;s de un arco iris en gradiente, seg&uacute;n la compa&ntilde;&iacute;a.</p>
<p style="text-align: justify;">En agosto de 2016, Instagram a&ntilde;ade la posibilidad de subir fotos y v&iacute;deos cuya duraci&oacute;n est&aacute; limitada a 24 horas (un d&iacute;a) en un nuevo apartado llamado Instagram Stories. Estas publicaciones se pueden acompa&ntilde;ar de filtros y stickers y hay varios formatos, como texto, m&uacute;sica, directo, boomerang, superzoom, focus, rewind y manos libres.</p>
<p style="text-align: justify;">En enero de 2018 Instagram se vincul&oacute; con la p&aacute;gina Giphy, la cual permite agregar una variedad de im&aacute;genes Graphics Interchange Format (GIF) al material que se quiera compartir.</p>
<p style="text-align: justify;">En 2018 se lanz&oacute; IGTV (Instagram TV), una funci&oacute;n que permite subir videos de m&aacute;s de un minuto y transmitir v&iacute;deos en vivo a trav&eacute;s de Instagram.</p>
<p style="text-align: justify;">En septiembre de 2018 los fundadores de la compa&ntilde;&iacute;a, Systrom y Krieger, se retiraron de la gesti&oacute;n de la misma, dej&aacute;ndola completamente en manos de Facebook.</p>
<p style="text-align: justify;">En noviembre de 2019, la red social elimin&oacute; la pesta&ntilde;a Suscripciones para "evitar malentendidos". En la pesta&ntilde;a se pod&iacute;a realizar un seguimiento de las acciones de otros usuarios: me gusta, comentarios y suscripciones.</p>
<p style="text-align: justify;">LENGUAJES: Python, HTML</p>
<p style="text-align: justify;"><span style="text-decoration: underline;"><em><strong>Discord:</strong></em></span> Discord es un servicio de mensajer&iacute;a instant&aacute;nea freeware de chat de voz VolP, video y chat por texto. Funciona a trav&eacute;s de servidores y est&aacute; separado en canales de texto o de voz. Discord est&aacute; disponible para Microsoft Windows, MacOS, Android, iOS y Linux. Puede ser usado desde un cliente ejecutable o desde el navegador. Si bien la aplicaci&oacute;n es de uso general, sus caracter&iacute;sticas la orientan hacia las comunidades de videojuegos. Desde julio de 2019, la plataforma cuenta con m&aacute;s de 350 millones de usuarios activos.</p>
<p style="text-align: justify;"><strong>HISTORIA:</strong></p>
<p style="text-align: justify;">El concepto de Discord viene del director ejecutivo Jason Citron, quien hab&iacute;a fundado OpenFeint, una plataforma de juegos sociales para dispositivos m&oacute;viles. Finalmente vendi&oacute; OpenFeint a GREE en 2011 por 104 millones de d&oacute;lares, que us&oacute; para fundar Hammer &amp; Chisel, un estudio de desarrollo de juegos, en 2012. Su producto original fue Fates Forever lanzado en 2014, que Citron anticip&oacute; como el primer juego MOBA en plataformas m&oacute;viles. Mientras que Fates Forever no tuvo &eacute;xito comercial debido a su baja popularidad, Citron not&oacute; las dificultades que tuvo su equipo en la construcci&oacute;n del juego al intentar representar juegos tales como Final Fantasy XIV y League of Legends para resolver conceptos de juego, destacando espec&iacute;ficamente cuestiones de actualidad.</p>
<p style="text-align: justify;">Algunas opciones de VoIP requer&iacute;an que los jugadores compartieran varias direcciones IP solo para conectarse, mientras que otros servicios como Skype o TeamSpeak ten&iacute;an recursos pesados y problemas de seguridad. Esto llev&oacute; a los desarrolladores a crear un servicio de chat mucho m&aacute;s amigable para usar basado en tecnolog&iacute;a m&aacute;s moderna.</p>
<p style="text-align: justify;">El lanzamiento p&uacute;blico de Discord fue en mayo de 2015. Seg&uacute;n Citron, la &uacute;nica &aacute;rea en la que presionaron con Discord fue en las comunidades de Reddit, donde descubrieron que muchas de estas estaban reemplazando los servidores de IRC por los de Discord. Discord se hizo popular a trav&eacute;s de los jugadores de ESports y de los torneos LAN, y de sitios de streaming como Twitch.</p>
<p style="text-align: justify;">La compa&ntilde;&iacute;a recaud&oacute; 20 millones de d&oacute;lares adicionales en financiamiento para el software en enero de 2016. El 10 de agosto de 2017, Discord anunci&oacute; p&uacute;blicamente el lanzamiento de la funcionalidad "Video llamada y pantalla compartida"; estas caracter&iacute;sticas se lanzaron inicialmente como una beta al 5% de los usuarios. El 5 de octubre de 2017, Discord lanz&oacute; la funcionalidad de videollamadas y uso compartido de pantallas a todos sus usuarios.</p>
<p style="text-align: justify;">LENGUAJES Y CARACTERISTICAS: El cliente de Discord se basa en el framework Electron y est&aacute; hecho con herramientas de desarrollo web, lo que le permite ser multiplataforma y ejecutarse en ordenadores personales y en la web. El software es apoyado por once centros de datos diseminados por todo el mundo para mantener baja la latencia con los clientes. Todas las versiones del cliente admiten el mismo conjunto de caracter&iacute;sticas. La aplicaci&oacute;n Discord para ordenadores personales est&aacute; dise&ntilde;ada espec&iacute;ficamente para usarse mientras se juega, ya que incluye caracter&iacute;sticas como baja latencia, servidores de chat de voz gratuitos para usuarios y una infraestructura de servidor dedicada. Los desarrolladores de Discord tambi&eacute;n agregaron llamadas de video y pantalla compartida en 2017. Las llamadas directas se agregaron en una actualizaci&oacute;n el 28 de julio de 2016, con soporte para llamadas entre dos o m&aacute;s usuarios. En diciembre de 2016, la compa&ntilde;&iacute;a present&oacute; su GameBridge API, que permite a los desarrolladores de juegos apoyar directamente la integraci&oacute;n con Discord dentro de los juegos. La documentaci&oacute;n del repositorio de Git para la API de Discord est&aacute; alojada en GitHub.</p>
<p style="text-align: justify;">Si bien el software en s&iacute; no tiene costo, los desarrolladores investigaron formas de monetizarlo, con opciones potenciales que incluyen opciones de personalizaci&oacute;n de pago, como emojis. En enero de 2017, se lanzaron las primeras funciones de pago con 'Discord Nitro'. Para una tarifa de suscripci&oacute;n mensual, los usuarios pueden obtener un avatar animado, usar emojis personalizados en todos los servidores, un mayor tama&ntilde;o de archivo m&aacute;ximo en las cargas de archivos (de 8 MB a 50 MB) y una insignia de perfil &uacute;nica. Los desarrolladores han afirmado que, si bien buscar&aacute;n formas de monetizar el software, nunca perder&aacute;n sus caracter&iacute;sticas principales. Discord utiliza el formato de audio Opus, que tiene baja latencia y est&aacute; dise&ntilde;ado para comprimir el habla.</p>
<p style="text-align: justify;"><strong><em><span style="text-decoration: underline;">Google Chrome:</span></em></strong> es un navegador web de c&oacute;digo cerrado5 desarrollado por Google, aunque derivado de proyectos de c&oacute;digo abierto (como el motor de renderizado Blink). Est&aacute; disponible gratuitamente. El nombre del navegador deriva del t&eacute;rmino en ingl&eacute;s usado para el marco de la interfaz gr&aacute;fica de usuario (&laquo;chrome&raquo;).</p>
<p style="text-align: justify;">Cuenta con m&aacute;s de 900 millones de usuarios, y dependiendo de la fuente de medici&oacute;n global, se considerada el navegador m&aacute;s usado de la Web, logrando la popularidad mundial en la primera posici&oacute;n.</p>
<p style="text-align: justify;">Los lanzamientos de Chrome son obtenidos a partir de Chromium, el proyecto de software libre que tambi&eacute;n sirve de base para el sistema operativo Chrome OS. Chromium es publicado con una licencia de derechos de autor laxa. En esencia, los aportes hechos por el proyecto libre Chromium fundamentan el c&oacute;digo fuente del navegador base sobre el que est&aacute; construido Chrome y por tanto tendr&aacute; sus mismas caracter&iacute;sticas, a las cuales Google adiciona otras que no son software libre. Tambi&eacute;n se cambia el nombre y logotipo por otros ligeramente diferentes para proteger la marca comercial de Google. El resultado se publica bajo t&eacute;rminos de software privativo. De acuerdo a la documentaci&oacute;n para desarrolladores, &laquo;&ldquo;Chromium&rdquo; es el nombre del proyecto, no del producto, y no deber&iacute;a aparecer nunca entre las variables del c&oacute;digo, nombres de APIs, etc. Util&iacute;cese &ldquo;chrome&rdquo; en su lugar&raquo;.</p>
<p style="text-align: justify;">El 2 de septiembre de 2008, sali&oacute; a la luz la primera versi&oacute;n al mercado, siendo esta una versi&oacute;n beta. Finalmente, el 11 de diciembre de 2008, se lanz&oacute; una versi&oacute;n estable al p&uacute;blico en general. Actualmente el navegador est&aacute; disponible para Windows, macOS, Linux, Android y iOS.</p>
<p style="text-align: justify;"><strong>HISTORIA:</strong></p>
<p style="text-align: justify;">Actualmente, Google Chrome cuenta con cuatro canales de distribuci&oacute;n para la descarga y prueba de todas sus compilaciones. Los canales comunes denominados &laquo;Stable&raquo;, &laquo;Beta&raquo; y &laquo;Dev&raquo; son accesibles desde el sitio web del proyecto Chromium, siendo los dos &uacute;ltimos repositorios para versiones de desarrollo. El 22 de julio de 2010, Google anunci&oacute; un nuevo sistema de lanzamientos m&aacute;s frecuente para ofrecer a los usuarios caracter&iacute;sticas nuevas cuanto antes, con la meta de entregar versiones estables cada 6 semanas.1819 Debido a esto, se incorpor&oacute; un nuevo canal de distribuci&oacute;n (denominado &laquo;Canary&raquo;) en aras de proporcionar una versi&oacute;n diaria para pruebas en conjunto con otros canales de desarrollo del navegador; el nombre del canal hace referencia a la pr&aacute;ctica de llevar un canario a las minas de carb&oacute;n para permitir a los trabajadores la detecci&oacute;n temprana de gases peligrosos.</p>
<p style="text-align: justify;">Chrome para Android e iOS</p>
<p style="text-align: justify;">En febrero de 2012, Google lanza &ldquo;Chrome para Android Beta&rdquo;, cuya versi&oacute;n est&aacute; disponible solo para Android 4.0 'Ice Cream Sandwich' en tel&eacute;fonos inteligentes y tabletas. Con la posibilidad de abrir m&uacute;ltiples pesta&ntilde;as, sincronizaci&oacute;n de marcadores y pesta&ntilde;as con la versi&oacute;n de escritorio, modo inc&oacute;gnito, y ver sitios de uso recientes. A finales de junio Chrome para Android se vuelve una versi&oacute;n estable.</p>
<p style="text-align: justify;">En junio de 2012, durante el Google I/O 2012, se anuncia que Chrome se utilizar&aacute; como navegador por defecto en Android 4.1 &lsquo;Jelly Bean&rsquo; junto con el lanzamiento de la tableta Nexus 7.23 Tambi&eacute;n se anuncia Chrome para iOS, el cual est&aacute; disponible en iPhone, iPod touch y iPad.</p>
<p style="text-align: justify;">En enero de 2013, las versiones Beta de Chrome tambi&eacute;n est&aacute;n disponibles en Android para tel&eacute;fonos y tabletas, las cuales son de las versiones m&aacute;s descargadas.</p>
<p style="text-align: justify;">Motor de renderizado Blink</p>
<p style="text-align: justify;">En abril de 2013, Google anuncia su nuevo motor de renderizado basado en WebKit para Chrome y Chromium, llamado Blink, el cual se utilizar&aacute; desde la versi&oacute;n 28. Las razones meramente t&eacute;cnicas del cambio desde WebKit, son optimizar el c&oacute;digo base y orientar su desarrollo espec&iacute;ficamente para contribuir a la Web y optimizar Chrome. Opera, otro navegador web, tambi&eacute;n usa Blink, y Microsoft Edge tambi&eacute;n lo hace desde la versi&oacute;n 79.</p>
<p style="text-align: justify;">LENGUAJES: Python, C++ y JavaScript</p>

</body>
</html>