<!DOCTYPE html>
<html lang="es">
<head>
  <meta name="viewport" content="width=device-width, initial-scale=1">
	<meta charset="utf-8">
	<title>portafolio web</title>
  <link href="styles.css" rel= "stylesheet">
	<link href="https://cdn.jsdelivr.net/npm/bootstrap@5.1.1/dist/css/bootstrap.min.css" rel="stylesheet" integrity="sha384-F3w7mX95PdgyTmZZMECAngseQB83DfGTowi0iMjiWaeVhAn4FJkqJByhZMI3AhiU" crossorigin="anonymous">
</head>
<body>
  
	<nav class="navbar navbar-expand-lg navbar-light bg-light">
  <div class="container-fluid">
    <a class="navbar-brand" href="#">Portafolio</a>
    <button class="navbar-toggler" type="button" data-bs-toggle="collapse" data-bs-target="#navbarNavAltMarkup" aria-controls="navbarNavAltMarkup" aria-expanded="false" aria-label="Toggle navigation">
      <span class="navbar-toggler-icon"></span>
    </button>
    <div class="collapse navbar-collapse" id="navbarNavAltMarkup">
      <div class="navbar-nav">
        <a class="nav-link active" aria-current="page" href="index.html">Home</a>
        <a class="nav-link" href="segundoparcial.html">Segundo parcial</a>
        <a class="nav-link" href="3er parcialHW.html"><b>Tercer Parcial</b></a>
      </div>
      <div class="container px-4">
  <div class="row gx-5">
    <div class="col">
     <div class="p-3 border bg-light">Victor Manuel M.</div>


    
    </div>
  </div>
</div>
    </div>
  </div>
</nav>

<a  href= Aplicacionesydatos.html class="btn btn-primary"> PDF </a>
  <h1><center>Aplicaciones y sus datos</center></h1>
<p style="text-align: justify;">&nbsp;</p>
<p style="text-align: justify;"><br /><span style="text-decoration: underline;"><strong>GitHub</strong></span><br />GitHub es una forja (plataforma de desarrollo colaborativo) para alojar proyectos utilizando el sistema de control de versiones Git. Se utiliza principalmente para la creaci&oacute;n de c&oacute;digo fuente de programas de ordenador. El software que opera GitHub fue escrito en Ruby on Rails. Desde enero de 2010, GitHub opera bajo el nombre de GitHub, Inc. Anteriormente era conocida como Logical Awesome LLC. El c&oacute;digo de los proyectos alojados en GitHub se almacena t&iacute;picamente de forma p&uacute;blica.<br />El 4 de junio de 2018 Microsoft compr&oacute; GitHub por la cantidad de 7500 millones de d&oacute;lares,12 al inicio el cambio de propietario gener&oacute; preocupaciones y la salida de algunos proyectos de este repositorio,3 sin embargo no fueron representativos. GitHub contin&uacute;a siendo la plataforma m&aacute;s importante de colaboraci&oacute;n para proyectos Open Source.</p>
<p style="text-align: justify;"><br /><span style="text-decoration: underline;">Historia</span><br />Github fue desarrollado por Chris Wanstrath, P. J. Hyett, Tom Preston-Werner y Scott Chacon usando Ruby on Rails, y empez&oacute; en 2008. Aunque la compa&ntilde;&iacute;a, Github, Inc, exist&iacute;a desde 2007.<br />El 24 de febrero de 2009, el equipo de GitHub anunci&oacute; en una charla en las oficinas centrales de Yahoo!, que en su primer a&ntilde;o hab&iacute;an logrado acumular 46.000 repositorios p&uacute;blicos, 17.000 de los cuales fueron creados en solo 1 mes. De los restantes, 6.200 eran forks y 4.600 se hab&iacute;an fusionado.<br />El 5 de julio de 2009, anunciaron la meta de 100.000 usuarios. Y casi un mes m&aacute;s tarde, en otra charla en las oficinas de Yahoo! anunciaron que hab&iacute;an crecido hasta los 90.000 repositorios, llegando a los 135.000 si se contaban los forks.<br />El 25 de julio de 2010, GitHub anunci&oacute; que hab&iacute;a llegado al mill&oacute;n de repositorios. Llegando a los 2 millones el 20 de abril de 2012.<br />El 2 de junio de 2011, el portal ReadWriteWeb report&oacute; que GitHub hab&iacute;a sobrepasado a SourceForge y Google Code en total de commits.<br />El 9 de julio de 2012, Peter Levine dijo que los beneficios de GitHub hab&iacute;an crecido un 300% anualmente desde 2008, siendo provechoso durante casi todo el trayecto.<br />El 16 de enero de 2013, sobrepasaron los 3 millones de usuarios registrados y alojaban ya m&aacute;s de 5 millones de repositorios. Llegando a los 10 millones el 23 de diciembre de 2013.<br />En junio de 2015, GitHub abri&oacute; su primera oficina fuera de Estados Unidos, en Jap&oacute;n.<br />El 29 de julio de 2015, levantaron una ronda de inversi&oacute;n de 250 millones de d&oacute;lares, liderada por Sequoia Capital. Esta ronda hizo que la valoraci&oacute;n de la compa&ntilde;&iacute;a ascendiera a los 2 billones de d&oacute;lares.<br />En 2016, Forbes Cloud 100 list&oacute; a GitHub como la n&uacute;mero 14.<br />El 28 de febrero de 2018, GitHub fue v&iacute;ctima del segundo mayor ataque de denegaci&oacute;n de servicio (DDoS) de la historia. Llegando a recibir un tr&aacute;fico de 1.35 terabits por segundo.<br />El 4 de junio de 2018, Microsoft anunci&oacute; la compra de la compa&ntilde;&iacute;a por un importe de 7500 millones de d&oacute;lares. Cerr&aacute;ndose la adquisici&oacute;n el 26 de octubre de 2018.<br />El 28 de julio de 2020 GitHub hizo p&uacute;blica su hoja de ruta donde da a conocer todos los nuevos avances y los desarrollos futuros que prepara esta plataforma. El objetivo principal es que el mundo est&eacute; preparado para los nuevos cambios que se avecinan.<br />Framework: Ruby on Rails</p>
<p style="text-align: justify;">&nbsp;</p>
<p style="text-align: justify;"><br /><span style="text-decoration: underline;"><strong>Airbnb</strong></span><br />Airbnb es una compa&ntilde;&iacute;a que ofrece una plataforma digital dedicada a la oferta de alojamientos a particulares y tur&iacute;sticos (alquiler vacacional) mediante la cual los anfitriones pueden publicitar y contratar el arriendo de sus propiedades con sus hu&eacute;spedes; anfitriones y hu&eacute;spedes pueden valorarse mutuamente, como referencia para futuros usuarios. El nombre es un acr&oacute;nimo de airbed and breakfast. Airbnb tiene una oferta de unas 2 000 000 propiedades en 192 pa&iacute;ses y 33 000 ciudades. Desde su creaci&oacute;n en noviembre de 2008 hasta junio de 2012 se realizaron 10 millones de reservas.</p>
<p style="text-align: justify;"><br /><span style="text-decoration: underline;">Historia</span><br />Airbnb fue fundada en noviembre de 2008 por Brian Chesky, Joe Gebbia y Nathan Blecharczyk en San Francisco, California.<br />Los tres compart&iacute;an un apartamento cuya renta subi&oacute; un 25 %, por lo que Blecharczyk tuvo que dejar su habitaci&oacute;n. Para pagar la renta, Chesky y Gebbia decidieron ofrecerla en el foro de asistentes a un congreso de dise&ntilde;adores en el que participaban, instalando un colch&oacute;n hinchable (en ingl&eacute;s, airbed). Esta experiencia inspir&oacute; la empresa y el nombre, basado en la expresi&oacute;n inglesa para definir el peque&ntilde;o hospedaje, Bed and Breakfast (cama y desayuno) o BnB, transformado en airbed and breakfast (colch&oacute;n hinchable y desayuno) o AirBnB, interpretable como &laquo;hotel de aire&raquo;.<br />La financiaci&oacute;n original fue obtenida de la incubadora de empresas Y Combinator. M&aacute;s tarde Greylock Partners, Sequoia Capital y Ashton Kutcher tambi&eacute;n invirtieron en la empresa. Airbnb abri&oacute; 6 oficinas internacionales a principios de 2012 en las siguientes ciudades; Par&iacute;s, Mil&aacute;n, Barcelona, Copenhague, Mosc&uacute; y S&atilde;o Paulo.<br />Lenguaje: Ruby</p>
<p style="text-align: justify;">&nbsp;</p>
<p style="text-align: justify;"><br /><span style="text-decoration: underline;"><strong>Twitter</strong></span><br />Twitter (pronunciaci&oacute;n en ingl&eacute;s: /ˈtwɪtəɹ/) (TWTR)5 es un servicio de microblogueo, con sede en San Francisco, California, Estados Unidos, con filiales en San Antonio (Texas) y Boston (Massachusetts) en Estados Unidos. Twitter, Inc. fue creado originalmente en California, pero est&aacute; bajo la jurisdicci&oacute;n de Delaware desde 2007. Desde que Jack Dorsey lo cre&oacute; en marzo de 2006, y lo lanz&oacute; en julio del mismo a&ntilde;o, la red ha ganado popularidad mundial y se estima que tiene m&aacute;s de 300 millones de usuarios, generando 65 millones de tuits al d&iacute;a y maneja m&aacute;s de 800 000 peticiones de b&uacute;squeda diarias. Ha sido denominado como el &laquo;SMS de Internet&raquo;.<br />La red permite enviar mensajes de texto plano de corta longitud, con un m&aacute;ximo de 280 caracteres (originalmente 140), llamados tuits o tweets (aunque esta &uacute;ltima acepci&oacute;n no est&aacute; recogida en la RAE), que se muestran en la p&aacute;gina principal del usuario. Los usuarios pueden suscribirse a los tweets de otros usuarios &ndash;a esto se le llama seguir y a los usuarios abonados se les llama seguidores, y a veces tuips (Twitter + peeps, seguidores novatos que a&uacute;n no han hecho muchos tuits). Por defecto, los mensajes son p&uacute;blicos, pudiendo difundirse privadamente mostr&aacute;ndose &uacute;nicamente a unos seguidores determinados. Los usuarios pueden tuitear desde la web del servicio, con aplicaciones oficiales externas (como para tel&eacute;fonos inteligentes), o mediante el Servicio de mensajes cortos (SMS) disponible en ciertos pa&iacute;ses. Si bien el servicio es gratis, acceder a &eacute;l v&iacute;a SMS comporta soportar tarifas fijadas por el proveedor de telefon&iacute;a m&oacute;vil.<br />A fecha de 27 de abril de 2015, es conocido que el dominio fue registrado hace 15 a&ntilde;os y 99 d&iacute;as, pero tres aspectos todav&iacute;a no est&aacute;n claros: la fecha exacta de presentaci&oacute;n p&uacute;blica del proyecto, si los tuits pueden ser o no redirigidos y si Twitter comparte los mensajes internos entre usuarios con la NSA.<br />En la actualidad Twitter factura m&aacute;s de 2500 millones de d&oacute;lares anuales y tiene un valor en bolsa superior a los 15 000 millones de d&oacute;lares.</p>
<p style="text-align: justify;"><br /><span style="text-decoration: underline;">Historia</span><br />Existe algo de controversia acerca de c&oacute;mo se gest&oacute; la idea que dio origen a Twitter. Seg&uacute;n algunas fuentes, la idea original surgi&oacute; dentro de la compa&ntilde;&iacute;a Odeo, mientras se estaba desarrollando un servicio de radio en l&iacute;nea (podcast) que no tuvo &eacute;xito debido al lanzamiento casi simult&aacute;neo de un producto similar por parte de iTunes.<br />El primer prototipo fue usado internamente entre los empleados de Odeo. Sus creadores habr&iacute;an sido los ex trabajadores de Google, Evan Williams y Biz Stone con la colaboraci&oacute;n de Jack Dorsey, Evan Henshaw-Plath y fundamentalmente de Noah Glass. Glass, que al poco tiempo fue despedido de la compa&ntilde;&iacute;a, ha manifestado que Twitter naci&oacute; en su propia m&aacute;quina. Y Henshaw-Plath vendi&oacute; su parte en el proyecto por 7000 d&oacute;lares, con lo que se compr&oacute; un viejo Volkswagen para salir a recorrer el pa&iacute;s.<br />Una vez iniciado el proyecto probaron varios nombres, alguno de los cuales fue "Status" (Stat.us), twitch (tic) por el ruido del vibrador de los tel&eacute;fonos, pero finalmente dieron con "Twitter", inspiraci&oacute;n de Glass en alusi&oacute;n a "Flickr". La versi&oacute;n definitiva se lanz&oacute; el 15 de julio de 2006, que seg&uacute;n palabras de Liam Well, su definici&oacute;n era "una corta r&aacute;faga de informaci&oacute;n intrascendente&rdquo;, el &ldquo;pio de un p&aacute;jaro&rdquo;, que en ingl&eacute;s es tweet. En octubre de ese a&ntilde;o, Stone, Williams, Dorsey y otros formaron Obvious Corporation, adquiriendo los derechos de Odeo, luego de que los inversores originales perdieran su inter&eacute;s ante el fracaso inicial del proyecto. Desde esa fecha, Twitter ha ido ganando adeptos r&aacute;pidamente. En marzo de 2007, gan&oacute; el premio South by Southwest Web Award en la categor&iacute;a de blog. Y en abril, la nueva compa&ntilde;&iacute;a Twitter, Inc se independiz&oacute; de su gestora.<br />Jack Dorsey es el actual presidente del Consejo de Administraci&oacute;n de Twitter, Inc, empresa que surgi&oacute; por el &eacute;xito cosechado. A principios de 2008, el equipo de Twitter estaba compuesto por 18 personas. Al a&ntilde;o siguiente, Twitter hab&iacute;a multiplicado su plantilla por cuatro y segu&iacute;a creciendo.<br />Aunque Twitter us&oacute; durante un corto per&iacute;odo de tiempo los servicios de publicidad como AdSense de Google, la compa&ntilde;&iacute;a decidi&oacute; descartar los ingresos por publicidad hasta que aumentara el n&uacute;mero de usuarios, y se financi&oacute; mientras tanto con inversiones de empresas de capital riesgo. En septiembre de 2009, Twitter anunci&oacute; cambios a las condiciones de servicio, dejando abierta la posibilidad de incluir publicidad en sus servicios.<br />El 3 de noviembre de 2009, apareci&oacute; la versi&oacute;n de Twitter en espa&ntilde;ol. El 8 de octubre de 2009 el microblogging public&oacute; una aplicaci&oacute;n para que los usuarios de forma no lucrativa lo tradujeran en espa&ntilde;ol, franc&eacute;s, italiano y alem&aacute;n. La traducci&oacute;n al espa&ntilde;ol fue la primera en culminarse y en estar disponible en la fecha indicada. El Palacio de La Moncloa, sede del Gobierno Espa&ntilde;ol y residencia de los presidentes ejecutivos, Jos&eacute; Luis Rodr&iacute;guez Zapatero, fue uno de los usuarios felicitados por Twitter por haber confiado en las posibilidades de este servicio antes de que fuera lanzado en espa&ntilde;ol.<br />En abril de 2010, Twitter lanz&oacute; una nueva estrategia para emitir publicidad en forma de un servicio llamado Promoted Tweets o Tweets promocionados. B&aacute;sicamente, se trata de tuits con el patrocinio de alguna empresa que aparecen como primer resultado cuando realicemos una b&uacute;squeda de mensajes en el servicio. Su patrocinio est&aacute; se&ntilde;alado con un mensaje resaltado tras los metadatos del mensaje. Solo se muestra un mensaje patrocinado, para evitar el intrusismo en las p&aacute;ginas de b&uacute;squeda. Adem&aacute;s, Twitter permite a los desarrolladores de terceros adoptar este servicio en sus aplicaciones, de modo que el creador de una aplicaci&oacute;n para Twitter de escritorio puede ganar parte de los beneficios publicitarios si incluye este servicio en su programa.<br />El 12 de septiembre de 2013, Twitter anunci&oacute; que hab&iacute;a presentado la documentaci&oacute;n a la SEC antes de una prevista salida a bolsa.<br />En marzo de 2015, Twitter lanza Periscope, una aplicaci&oacute;n para poder emitir v&iacute;deo en tiempo real. Justo un a&ntilde;o despu&eacute;s, en el primer aniversario de dicho lanzamiento, se hab&iacute;an realizado m&aacute;s de 200 millones de emisiones en directo.<br />En julio de 2018, la compa&ntilde;&iacute;a realiz&oacute; su primer ejercicio de purga, o limpieza de cuentas falsas. El objetivo del ejercicio fue restablecer la transparencia de la red social en b&uacute;squeda de una mejor conversaci&oacute;n entre usuarios reales. La purga se llev&oacute; a cabo en aquellas<br />cuentas que aparecieran como "congeladas o restringidas", dando la oportunidad a sus propietarios que no funcionaran como bots, de confirmar la contrase&ntilde;a y resetearla.<br />Lenguaje de programaci&oacute;n y framework: Twitter se basa en el lenguaje de programaci&oacute;n Scala y utiliza un framework conocido como Bootstrap para la interfaz de usuario.</p>
<p style="text-align: justify;">&nbsp;</p>
<p style="text-align: justify;"><br /><span style="text-decoration: underline;"><strong>Facebook</strong></span><br />Facebook, Inc. (NASDAQ: FB), estilizado como FACEBOOK, es un conglomerado estadounidense de redes sociales con sede en Menlo Park, California. Fue fundado por Mark Zuckerberg, junto con sus compa&ntilde;eros de cuarto y estudiantes de Harvard, Eduardo Saverin, Andrew McCollum, Dustin Moskovitz y Chris Hughes, originalmente como TheFacebook.com, el actual Facebook, es la red social m&aacute;s usada del mundo. Facebook es una de las empresas m&aacute;s valiosas del mundo. Se considera una de las cinco grandes empresas de tecnolog&iacute;a junto con Microsoft, Amazon, Apple y Google.<br />Facebook ofrece otros productos y servicios m&aacute;s all&aacute; de su plataforma de redes sociales, incluidos Facebook Messenger, Facebook Watch y Facebook Portal. Tambi&eacute;n ha adquirido Instagram, WhatsApp, Oculus VR, Giphy y Mapillary, y tiene una participaci&oacute;n del 9,9% en Jio Platforms.<br />El 8 de abril de 2011, Facebook adquiri&oacute; Instagram por 2000 millones de d&oacute;lares, y en febrero de 2014 compr&oacute; el servicio de mensajer&iacute;a m&oacute;vil WhatsApp por 19 000 millones de d&oacute;lares. El 1 de mayo de 2018, Facebook anunci&oacute; sus planes para lanzar un nuevo servicio de citas. Seg&uacute;n Mark Zuckerberg: &laquo;Hay 200 millones de personas en Facebook identificados como solteros, as&iacute; que claramente hay algo que hacer aqu&iacute;&raquo;. A ra&iacute;z del esc&aacute;ndalo de miner&iacute;a de datos de Cambridge Analytica, el servicio contar&aacute; con funciones de privacidad, y tus amigos no podr&aacute;n ver tu perfil de citas.<br /><span style="text-decoration: underline;">Historia</span><br />Facebook solicit&oacute; una oferta p&uacute;blica inicial (OPI) el 1 de febrero de 2012. El prospecto preliminar indicaba que la compa&ntilde;&iacute;a buscaba recaudar $ 5 mil millones. El documento anunci&oacute; que la compa&ntilde;&iacute;a ten&iacute;a 845 millones de usuarios activos mensuales y su sitio web presentaba 2700 millones de "me gusta" y comentarios diarios.8 Despu&eacute;s de la OPI, Zuckerberg retendr&iacute;a una participaci&oacute;n del 22% en la propiedad de Facebook y poseer&iacute;a el 57% de las acciones con derecho a voto.9<br />Underwriting valuaron las acciones en 38 d&oacute;lares cada una, fijando as&iacute; el precio de la empresa en $ 104 mil millones de d&oacute;lares, la valoraci&oacute;n m&aacute;s grande hasta la fecha para una empresa que cotiza en bolsa.<br />El 16 de mayo, un d&iacute;a antes de la OPI, Facebook anunci&oacute; que vender&iacute;a un 25 % m&aacute;s de acciones de lo previsto originalmente debido a la alta demanda. La OPI recaud&oacute; $ 16 mil millones, lo que la convierte en la tercera m&aacute;s grande en la historia de Estados Unidos (justo por delante de AT&amp;T Wireless y solo detr&aacute;s de General Motors y Visa). El precio de las acciones dej&oacute; a la compa&ntilde;&iacute;a con una capitalizaci&oacute;n de mercado m&aacute;s alta que todas las empresas estadounidense, superando a compa&ntilde;&iacute;as como Amazon, McDonald's, Disney y Kraft Foods, e hizo que las acciones de Zuckerberg valieran $ 19 mil millones.<br />Negociar acciones en la bolsa, lo que empez&oacute; el 18 de mayo, se retras&oacute; ese d&iacute;a debido a problemas t&eacute;cnicos con la bolsa NASDAQ. Las acciones lucharon por mantenerse por encima del precio de la OPI durante la mayor parte del d&iacute;a, lo que oblig&oacute; a los suscriptores a recomprar acciones para mantener el precio. En la campana de cierre, las acciones se valuaron en $ 38.23,16 solo $ 0.23 por encima del precio de la OPI y $ 3.82 por debajo del valor de la campana de apertura. La apertura fue ampliamente descrita por la prensa financiera como una decepci&oacute;n. No obstante, la acci&oacute;n estableci&oacute; un nuevo r&eacute;cord para el volumen de negociaci&oacute;n de una OPI. El 25 de mayo de 2012, la acci&oacute;n finaliz&oacute; su primera semana completa de cotizaci&oacute;n a 31,91 d&oacute;lares, un descenso del 16,5%.<br />El 22 de mayo de 2012, los reguladores de la Financial Industry Regulatory Authority (FINRA) de Wall Street anunciaron que hab&iacute;an comenzado a investigar si los bancos que suscrib&iacute;an a Facebook hab&iacute;an compartido informaci&oacute;n de manera inadecuada solo con clientes seleccionados, en lugar del p&uacute;blico en general. Las acusaciones provocaron "furia" entre algunos inversores y llevaron a la presentaci&oacute;n inmediata de varias demandas, una de ellas una demanda colectiva que reclama m&aacute;s de $ 2.5 mil millones en p&eacute;rdidas debido a la OPI.20 Bloomberg estim&oacute; que los inversores minoristas pueden haber perdido aproximadamente $ 630 millones en acciones de Facebook desde su debut.<br />Standard &amp; Poor's a&ntilde;adi&oacute; a Facebook, Inc. a su &iacute;ndice S&amp;P 500 el 21 de diciembre de 2013.<br />En mayo de 2019, Facebook fund&oacute; Libra Networks, supuestamente para desarrollar su propia criptomoneda estable. Se ha informado que Libra est&aacute; siendo respaldada por compa&ntilde;&iacute;as financieras como Visa, Mastercard, PayPal y Uber. Se espera que el consorcio de empresas junte $ 10 millones cada uno para financiar el lanzamiento de la moneda de criptomoneda llamada Libra.<br />Lenguaje de programaci&oacute;n y framework: La parte visible de Facebook est&aacute; escrita en su mayor&iacute;a con lenguaje PHP, por lo que su desempe&ntilde;o es cr&iacute;tico para todo el sistema.</p>
<p style="text-align: justify;">&nbsp;</p>
<p style="text-align: justify;"><br /><span style="text-decoration: underline;"><strong>Youtube</strong></span><br />Youtube es un sitio web de origen estadounidense dedicado a compartir videos. Presenta una variedad de clips de pel&iacute;culas, programas de televisi&oacute;n y v&iacute;deos musicales, as&iacute; como contenidos amateur como videoblogs y YouTube Gaming. Las personas que crean contenido para esta plataforma generalmente son conocidas como youtubers.<br />Fue creado por tres antiguos empleados de PayPal en febrero de 20053 y, en octubre de 2006 fue adquirido por Google Inc. a cambio de 1650 millones de d&oacute;lares y ahora opera como una de sus filiales. Es el sitio web de su tipo m&aacute;s utilizado en internet.<br />YouTube usa un reproductor en l&iacute;nea basado en HTML5, que incorpor&oacute; poco despu&eacute;s de que la W3C lo presentara y que es soportado por los navegadores web m&aacute;s difundidos. Antiguamente su reproductor funcionaba con Adobe Flash, pero esta herramienta fue desechada en 2016. Los enlaces a v&iacute;deos de YouTube pueden ser tambi&eacute;n insertados en blogs y sitios electr&oacute;nicos personales usando API o incrustando cierto c&oacute;digo HTML.<br />El 29 de agosto de 2017, YouTube dio a conocer algunos cambios en el dise&ntilde;o de su versi&oacute;n web y present&oacute; un nuevo logotipo, que por primera vez separa el nombre del &iacute;cono.<br />A partir de agosto de 2018, el sitio web est&aacute; clasificado como el segundo sitio m&aacute;s popular del mundo, seg&uacute;n Alexa Internet, justo detr&aacute;s de Google. A partir de mayo de 2019, se suben a YouTube m&aacute;s de 500 horas de contenido de v&iacute;deo cada minuto. Seg&uacute;n los ingresos<br />publicitarios trimestrales reportados, se estima que YouTube tiene ingresos anuales de US $ 15 mil millones.<br />YouTube se ha enfrentado a cr&iacute;ticas sobre aspectos de sus operaciones, incluido el manejo del contenido con derechos de autor contenido en los videos subidos, sus algoritmos de recomendaci&oacute;n que perpet&uacute;an videos que promueven teor&iacute;as de conspiraci&oacute;n y falsedades, albergan videos aparentemente dirigidos a ni&ntilde;os pero que contienen violencia o sugerencia sexual, videos de menores que atraen actividades ped&oacute;filas en sus secciones de comentarios y pol&iacute;ticas fluctuantes sobre los tipos de contenido que pueden ser monetizados con publicidad.</p>
<p style="text-align: justify;"><br /><span style="text-decoration: underline;">Historia</span><br />YouTube fue fundado por Chad Hurley, Steve Chen y Jawed Karim en febrero de 2005 en San Bruno, California. Todos ellos se conocieron cuando trabajaban en PayPal, Hurley y Karim como ingenieros y Chen como dise&ntilde;ador.<br />De acuerdo con Hurley y Chen, la idea de YouTube surgi&oacute; ante las dificultades que experimentaron al tratar de compartir v&iacute;deos tomados durante una fiesta en San Francisco. Esta historia ha sido considerada una versi&oacute;n muy simplificada, y Chen ha reconocido que esta idea se puede haber promovido por la necesidad de presentar una historia sencilla al mercado.11 Karim ha declarado que la fiesta nunca ocurri&oacute;, y que la idea de compartir v&iacute;deos en Internet fue suya.11 Sus compa&ntilde;eros han declarado que la fiesta s&iacute; ocurri&oacute;, y que la idea original de Karim era crear una p&aacute;gina de citas, donde las personas pudiesen calificarse sobre la base de sus v&iacute;deos. Karim reconoce haber sido influenciado por un sitio de citas llamado HotorNot.com, donde los usuarios pod&iacute;an cargar fotos suyas, que luego eran calificadas por otros usuarios.<br />El dominio fue activado el 14 de febrero de 2005,12 y el 23 de abril fue cargado el primer v&iacute;deo, Me at the Zoo (&lsquo;Yo en el zool&oacute;gico&rsquo;). En la primavera YouTube entr&oacute; en l&iacute;nea. Sin embargo, los creadores se percataron r&aacute;pidamente de que los usuarios cargaban toda clase de v&iacute;deos, dejando atr&aacute;s la idea original. El tr&aacute;fico se dispar&oacute; cuando la gente empez&oacute; a colocar enlaces de YouTube en sus p&aacute;ginas de MySpace. El r&aacute;pido crecimiento del sitio atrajo a Time Warner y Sequoia Capital, que invirtieron en el mismo. Luego de que, en octubre de 2005, la empresa Nike colocara un spot protagonizado por Ronaldinho, grandes compa&ntilde;&iacute;as empezaron a sentirse atra&iacute;das por YouTube. Solo en 2005, Sequoia tuvo que invertir 8,5 millones de d&oacute;lares estadounidenses en el sitio.<br />Para diciembre de 2005, las p&aacute;ginas de YouTube eran visitadas unas 50 millones de veces al d&iacute;a. Sin embargo, luego de que el v&iacute;deo musical Lazy Sunday, transmitido originalmente en el show Saturday Night Live, fuera cargado a YouTube, las visitas se dispararon de nuevo hasta alcanzar las 250 millones de visualizaciones diarias. Para mayo de 2006, seg&uacute;n Alexa.com, YouTube alcanz&oacute; los 2000 millones de visualizaciones por d&iacute;a, y para mediados de agosto hab&iacute;a alcanzado la marca de 7000 millones en diversas oportunidades;13 adem&aacute;s, se hab&iacute;a convertido en el d&eacute;cimo sitio m&aacute;s visitado en Estados Unidos. En aquel momento, el New York Post estim&oacute; que YouTube deb&iacute;a valer entre 600 y 1000 millones de d&oacute;lares estadounidenses.13 MySpace.com y Google publicaron sus propias versiones de YouTube, sin &eacute;xito.<br />Para octubre de 2006, las oficinas de YouTube permanec&iacute;an en el condado de San Mateo, ubicadas en el segundo piso de un edificio, y contaba con unos 60 empleados. Un ejecutivo de Universal Music Group hab&iacute;a anunciado hace poco que &laquo;YouTube les deb&iacute;a decenas de millones de d&oacute;lares&raquo;, por violaci&oacute;n de derechos de autor.14 Mark Cuban, cofundador de Broadcast.com, un servicio de radio por Internet comprado por Yahoo en 1999, hab&iacute;a declarado un mes antes que &laquo;solo un tonto comprar&iacute;a YouTube por los potenciales problemas legales que enfrentar&iacute;a&raquo;.14 No obstante, los propietarios del sitio ya se hab&iacute;an comprometido con Warner Music para mejorar el servicio, de manera tal que pudiesen detectar m&aacute;s r&aacute;pidamente cu&aacute;ndo un v&iacute;deo de su propiedad era cargado al sitio. No obstante, a inicios de ese mes se public&oacute; un reporte en el Wall Street Journal que indicaba que Google iba a comprar YouTube por 1600 millones de d&oacute;lares. Dicha informaci&oacute;n inicialmente fue negada por YouTube y Google, que la calificaron como rumores.<br />Ese mismo mes Google compr&oacute; YouTube por 1650 millones de d&oacute;lares en acciones. En el momento de la compra 100 millones de v&iacute;deos en YouTube eran visualizados y 65 mil nuevos v&iacute;deos era a&ntilde;adidos diariamente. Adem&aacute;s, unos 72 millones de personas la visitaban por mes. Hurley y Chen mantuvieron sus cargos, al igual que los 67 empleados que en ese momento trabajaban en la empresa. En los d&iacute;as anteriores, YouTube hab&iacute;a firmado dos acuerdos con Universal Music Group y la CBS; y Google hab&iacute;a firmado acuerdos con Sony BMG y Warner Music para la distribuci&oacute;n de v&iacute;deos musicales.<br />Para junio de 2008, el 38 % de los v&iacute;deos visualizados en Internet proven&iacute;an de YouTube; el competidor m&aacute;s cercano solo llegaba a representar el 4 %. Aunque Google no revel&oacute; las cifras, se estim&oacute; que el sitio gener&oacute; 200 millones de d&oacute;lares estadounidenses ese a&ntilde;o. En ese mes, un anuncio en la p&aacute;gina de inicio de YouTube costaba 175 000 d&oacute;lares diariamente, y el cliente deb&iacute;a comprometerse a gastar 50 000 d&oacute;lares adicionales en anuncios en Google u otras p&aacute;ginas de YouTube. Sin embargo, debido a que el contenido de la vasta mayor&iacute;a de los v&iacute;deos en YouTube no atra&iacute;an a los anunciantes, los precios de los anuncios se<br />colapsaron. YouTube procedi&oacute; a presionar a los estudios de cine y televisi&oacute;n para que produjeran contenido audiovisual de calidad, y les ofreci&oacute; canales destacados, donde pod&iacute;an presentar anuncios de estrenos de pel&iacute;culas y cortos de televisi&oacute;n. Tambi&eacute;n lleg&oacute; a colocar anuncios antes del inicio de un v&iacute;deo, pero luego descubrieron que el 70 % de los usuarios abandonaba el sitio antes de que este terminase.<br />La relaci&oacute;n de YouTube con las empresas productoras de televisi&oacute;n y cine ha sido variada. Viacom contin&uacute;a la demanda contra YouTube por 1000 millones de d&oacute;lares, iniciada en marzo de 2007, por supuesta violaci&oacute;n masiva de derechos de autor. Por otro lado, Disney firm&oacute; a finales de marzo de 2009 un acuerdo con YouTube, autorizando la transmisi&oacute;n de v&iacute;deos cortos de la ABC y ESPN. Disney podr&aacute; presentar anuncios en YouTube gracias a este trato. En abril de 2009 Google anunci&oacute; que YouTube firm&oacute; alianzas con algunos estudios de Hollywood para que el sitio pudiese mostrar programas de televisi&oacute;n y pel&iacute;culas completas. En enero de 2010, se lanza YouTube Rentals, un servicio de videoclub por Internet con pel&iacute;culas completas que se pueden ver al instante previo pago.<br />En los &uacute;ltimos a&ntilde;os, Google todav&iacute;a no ha logrado convertir efectivamente el alto tr&aacute;fico de YouTube en ganancias; la empresa ha reconocido esto, pero se ha negado a proporcionar las cifras.21 De acuerdo con un art&iacute;culo de la revista Forbes, se estimaba que YouTube generar&iacute;a 240 millones de d&oacute;lares en 2009, quedando muy por debajo de los 710 millones en costos operativos del sitio. Seg&uacute;n un analista de la Credit Suisse, YouTube estar&iacute;a presentando p&eacute;rdidas por 470 millones de d&oacute;lares estadounidenses en 2009;22 sin embargo, otras empresas estiman las p&eacute;rdidas en 174,2 millones.<br />En 2015, se consideraba que YouTube no era rentable, siendo que en 2014 report&oacute; ingresos por $4.000 millones de d&oacute;lares, frente a los $3000 millones del a&ntilde;o anterior, pero luego de pagar por el contenido y los equipos que reproducen de forma r&aacute;pida los videos, el balance qued&oacute; en un punto de equilibrio, o sea que no gan&oacute; ni perdi&oacute; dinero.Estos resultados reflejan las dificultades que tiene para expandir su audiencia que est&aacute; conformada principalmente por adolescentes y preadolescentes. La mayor&iacute;a de los usuarios utiliza al sitio como un dep&oacute;sito de videos a los cuales se accede desde enlaces o c&oacute;digo insertado que son publicados en otras p&aacute;ginas, en lugar de visitar YouTube.com.<br />En febrero de 2015, YouTube lanz&oacute; una aplicaci&oacute;n m&oacute;vil conocida como YouTube Kids. La aplicaci&oacute;n est&aacute; dise&ntilde;ada para los ni&ntilde;os, y cuenta con una interfaz simplificada, con selecciones de canales cuyo contenido sea apropiado para ni&ntilde;os y funciones de control parental.24M&aacute;s tarde, el 26 de agosto de 2015, YouTube lanz&oacute; YouTube Gaming, un sub-<br />sitio orientado a juegos de v&iacute;deo y una aplicaci&oacute;n que pretende competir con la Twitch.tv de Amazon.com.25 En el a&ntilde;o 2015 tambi&eacute;n se anunci&oacute; un servicio pr&eacute;mium de YouTube titulado YouTube Red, que ofrece a los usuarios contenido libre de anuncios y tambi&eacute;n la posibilidad de descargar videos entre otras cosas.26 El 10 de agosto de 2015, Google anunci&oacute; que estaba creando una nueva compa&ntilde;&iacute;a, Alphabet, para actuar como holding de Google, con el cambio en la informaci&oacute;n financiera a partir del cuarto trimestre de 2015. YouTube sigue siendo una subsidiaria de Google.27 En enero de 2016, YouTube ampli&oacute; su sede en San Bruno al comprar oficinas por 215 millones de d&oacute;lares. El complejo puede albergar hasta 2800 empleados.<br />YouTube tambi&eacute;n renov&oacute; su apariencia de aplicaci&oacute;n m&oacute;vil en agosto de 2017. En Latinoam&eacute;rica ocurri&oacute; el 4 de septiembre de 2017. La plataforma de videos YouTube dio a conocer las nuevas caracter&iacute;sticas de su aplicaci&oacute;n m&oacute;vil, tal como el nuevo dise&ntilde;o, velocidades en reproducci&oacute;n, visualizaci&oacute;n autom&aacute;tica y opciones con pantalla completa. En su blog oficial, la plataforma destac&oacute; que est&aacute; en evoluci&oacute;n, por lo que han comenzado una serie de actualizaciones durante lo que resta del a&ntilde;o, con un nuevo nivel de funcionalidad y una mirada constante a trav&eacute;s de las experiencias m&oacute;viles y de escritorio. Apunt&oacute; que el nuevo dise&ntilde;o consiste en un encabezado en blanco, para que el contenido resalte, y se movimiento de las pesta&ntilde;as de navegaci&oacute;n hasta la parte inferior de la aplicaci&oacute;n, para que est&eacute;n m&aacute;s cerca de los pulgares. Tambi&eacute;n, expuso que se agregaron nuevas pesta&ntilde;as en la biblioteca y en la cuenta que le dan acceso f&aacute;cil a lo que est&aacute; buscando. Asimismo, explic&oacute; que a principios de este a&ntilde;o, se introdujo un gestor que permite doblar el toque en el lado izquierdo o derecho de un v&iacute;deo para avanzar o retroceder r&aacute;pidamente 10 segundos. La empresa con sede en San Bruno, California, coment&oacute; que en los pr&oacute;ximos meses &ldquo;experimentaremos una funci&oacute;n que permite saltar entre v&iacute;deos con un movimiento: simplemente desliza hacia la izquierda para ver un v&iacute;deo anterior o desliza el dedo hacia la derecha para ver el siguiente&rdquo;. En el caso de la velocidad, manifest&oacute; que a los usuarios les encanta acelerar y ralentizar la reproducci&oacute;n de un v&iacute;deo en el escritorio, por lo que dicha funci&oacute;n se traslad&oacute; a la aplicaci&oacute;n m&oacute;vil, para que los usuarios le den la velocidad que deseen. Tambi&eacute;n a&ntilde;adir&aacute; una funci&oacute;n que permita ver filas de videos sugeridos mientras se observa un v&iacute;deo con pantalla completa, en tanto que en poco se cambiar&aacute; la forma en que se ven los videos en vertical, cuadro u horizontal, sin barras negras en los lados.<br />YouTube cambi&oacute; de logotipo por primera vez en su historia, dado a conocer el 29 de agosto de 2017. Ahora, el logo tiene la palabra YouTube con todas sus letras negras, mientras que el s&iacute;mbolo de &ldquo;play&rdquo; de color rojo aparece al costado izquierdo.<br />El 11 de noviembre del 2020 Youtube se cay&oacute; a nivel global, causando que las redes sociales se llenaran de memes.<br />Lenguaje de programaci&oacute;n y framework: del lado del cliente usa javascript y del lado del servidor usa C, C++, Python, Java y Go.</p>
<p style="text-align: justify;">&nbsp;</p>
<p style="text-align: justify;"><br /><span style="text-decoration: underline;"><strong>Tiktok</strong></span><br />TikTok, conocido en China como Douyin (Chino: 抖音; pinyin: Dǒuyīn), es un servicio de redes sociales para compartir videos propiedad de la empresa china ByteDance. La plataforma de redes sociales se utiliza para hacer una variedad de videos de formato corto, desde g&eacute;neros como danza, comedia y educaci&oacute;n, que tienen una duraci&oacute;n de tres segundos a un minuto (tres minutos para algunos usuarios).5 TikTok es una versi&oacute;n internacional de Douyin, que se lanz&oacute; originalmente en el mercado chino en septiembre de 2016. M&aacute;s tarde, TikTok se lanz&oacute; en 2017 para iOS y Android en la mayor&iacute;a de los mercados fuera de China continental; sin embargo, solo estuvo disponible en todo el mundo despu&eacute;s de fusionarse con otro servicio de redes sociales chino, Musical.ly, el 2 de agosto de 2018.<br />TikTok y Douyin tienen casi la misma interfaz de usuario pero no tienen acceso al contenido del otro. Cada uno de sus servidores est&aacute; basado en el mercado donde la aplicaci&oacute;n respectiva est&aacute; disponible.8 Los dos productos son similares, pero las caracter&iacute;sticas no son id&eacute;nticas. Douyin incluye una funci&oacute;n de b&uacute;squeda en video que puede buscar por la cara de las personas para ver m&aacute;s videos de ellos y otras caracter&iacute;sticas como comprar, reservar hoteles y hacer rese&ntilde;as geoetiquetadas. Desde su lanzamiento en 2016, TikTok/Douyin gan&oacute; r&aacute;pidamente popularidad en Asia Oriental, Asia del Sur, el Sudeste Asi&aacute;tico, Estados Unidos, Turqu&iacute;a, Rusia y otras partes del mundo. A octubre de 2020, TikTok super&oacute; los 2 mil millones de descargas m&oacute;viles en todo el mundo.<br />Vanessa Pappas es la directora ejecutiva de TikTok y asumi&oacute; el cargo tras la dimisi&oacute;n de Kevin A. Mayer el 27 de agosto de 2020. El 3 de agosto de 2020, el presidente de Estados Unidos, Donald Trump, amenaz&oacute; con prohibir TikTok en Estados Unidos el 15 de septiembre si fracasaban las negociaciones para que Microsoft o una empresa diferente "muy estadounidense" comprara la empresa. El 6 de agosto, Trump firm&oacute; dos &oacute;rdenes ejecutivas que proh&iacute;ben las "transacciones" estadounidenses con TikTok y WeChat a sus respectivas empresas matrices ByteDance y Tencent, que entrar&aacute;n en vigor 45 d&iacute;as despu&eacute;s de la firma. La prohibici&oacute;n prevista de la aplicaci&oacute;n el 20 de septiembre de 20202223 fue pospuesta una<br />semana y luego bloqueada por un juez federal.24252627 La aplicaci&oacute;n ha sido prohibida por el gobierno de India desde junio de 2020 junto con otras 22328 aplicaciones chinas en respuesta a un choque fronterizo con China.29 Pakist&aacute;n prohibi&oacute; TikTok citando videos 'inmorales' e 'indecentes' el 9 de octubre de 2020, pero revirti&oacute; su prohibici&oacute;n diez d&iacute;as despu&eacute;s, el 19 de octubre de 2020.303132 Luego, en marzo de 2021, un tribunal orden&oacute; prohibir TikTok nuevamente debido a quejas sobre contenido "indecente".<br />Morning Consult clasific&oacute; a TikTok como la tercera marca de m&aacute;s r&aacute;pido crecimiento en 2020, solo despu&eacute;s de Zoom y Peacock.</p>
<p style="text-align: justify;"><br /><span style="text-decoration: underline;">Historia</span><br />Douyin fue lanzado por ByteDance en Beijing, China, en septiembre de 2016, originalmente con el nombre A.me, antes de cambiar su nombre a Douyin (抖音) en diciembre de 2016.3536 ByteDance planeaba que Douyin se expandiera al extranjero. El fundador de ByteDance, Zhang Yiming, declar&oacute; que "China es el hogar de solo una quinta parte de los usuarios de Internet a nivel mundial. Si no nos expandimos a escala global, estamos destinados a perder frente a los pares que miran las cuatro quintas partes. Entonces, globalizarse es imprescindible". Douyin se desarroll&oacute; en 200 d&iacute;as y en un a&ntilde;o ten&iacute;a 100 millones de usuarios, con m&aacute;s de mil millones de videos vistos cada d&iacute;a. TikTok se lanz&oacute; al mercado internacional en septiembre de 2017. El 23 de enero de 2018, la aplicaci&oacute;n TikTok ocup&oacute; el primer lugar entre las descargas gratuitas de aplicaciones en las tiendas de aplicaciones de Tailandia y otros pa&iacute;ses.<br />TikTok se ha descargado m&aacute;s de 130 millones de veces en los Estados Unidos y ha alcanzado los 2 mil millones de descargas en todo el mundo, seg&uacute;n datos de la firma de investigaci&oacute;n m&oacute;vil Sensor Tower que excluye a los usuarios de Android en China. En los Estados Unidos, muchas celebridades, incluidos Jimmy Fallon y Tony Hawk, comenzaron a usar la aplicaci&oacute;n en 2018; otras celebridades como Jennifer Lopez, Jessica Alba, Will Smith y Justin Bieber tambi&eacute;n se unieron a TikTok y muchas otras celebridades lo han seguido.<br />El 3 de septiembre de 2019, TikTok y la Liga Nacional de F&uacute;tbol Americano (NFL) anunciaron una asociaci&oacute;n de varios a&ntilde;os. El acuerdo se produjo solo dos d&iacute;as antes del inicio de la temporada n&uacute;mero 100 de la NFL en el Soldier Field, donde TikTok organiz&oacute; actividades para los fan&aacute;ticos en honor al acuerdo. La asociaci&oacute;n implica el lanzamiento de una cuenta oficial de TikTok de la NFL, que generar&aacute; nuevas oportunidades de m&aacute;rketing, como videos<br />patrocinados y desaf&iacute;os de hashtag. En julio de 2020, TikTok, excluyendo Douyin, report&oacute; cerca de 800 millones de usuarios activos mensuales en todo el mundo despu&eacute;s de menos de cuatro a&ntilde;os de existencia.<br />El 9 de noviembre de 2017, la empresa matriz de TikTok, ByteDance, gast&oacute; hasta mil millones de d&oacute;lares para comprar musical.ly, una startup con sede en Shangh&aacute;i y una oficina en el extranjero en Santa M&oacute;nica, California, Estados Unidos Musical.ly era una plataforma de videos de redes sociales que permit&iacute;a a los usuarios crear videos cortos de sincronizaci&oacute;n de labios y comedia, lanzada inicialmente en agosto de 2014. Era bien conocida, especialmente para el p&uacute;blico m&aacute;s joven. Esperando aprovechar la base de usuarios j&oacute;venes de la plataforma digital de Estados Unidos, TikTok se fusion&oacute; con musical.ly el 2 de agosto de 2018 para crear una comunidad de video m&aacute;s grande, con cuentas y datos existentes consolidados en una aplicaci&oacute;n, manteniendo el t&iacute;tulo TikTok. Esto termin&oacute; musical.ly y convirti&oacute; a TikTok en una aplicaci&oacute;n mundial, excluyendo a China, ya que China ya tiene Douyin.<br />Expansi&oacute;n en otros mercados<br />A partir de 2018, TikTok se ha puesto a disposici&oacute;n en m&aacute;s de 150 mercados y en 75 idiomas. TikTok se descarg&oacute; m&aacute;s de 104 millones de veces en la tienda de aplicaciones de Apple durante la primera mitad de 2018, seg&uacute;n los datos proporcionados a CNBC por Sensor Tower.<br />Despu&eacute;s de fusionarse con musical.ly en agosto, las descargas aumentaron y TikTok se convirti&oacute; en la aplicaci&oacute;n m&aacute;s descargada en los Estados Unidos en octubre de 2018, lo que musical.ly hab&iacute;a hecho una vez antes. En febrero de 2019, TikTok, junto con Douyin, alcanz&oacute; mil millones de descargas a nivel mundial, excluidas las instalaciones de Android en China. En 2019, los medios de comunicaci&oacute;n citaron a TikTok como la s&eacute;ptima aplicaci&oacute;n m&oacute;vil m&aacute;s descargada de la d&eacute;cada, de 2010 a 2019. Tambi&eacute;n fue la aplicaci&oacute;n m&aacute;s descargada en la App Store de Apple en 2018 y 2019, superando a Facebook, YouTube e Instagram. En septiembre de 2020, se confirm&oacute; un acuerdo entre ByteDance y Oracle en el que este &uacute;ltimo actuar&aacute; como socio para proporcionar alojamiento en la nube. Walmart tiene la intenci&oacute;n de invertir en TikTok. En noviembre de 2020, TikTok firm&oacute; un acuerdo de licencia con Sony Music. En enero de 2021, Warner Music Group firm&oacute; un acuerdo de licencia con TikTok. Lenguaje de programaci&oacute;n: Python, Java, C++ y Go<br />Tiktok<br />Telegram es una plataforma de mensajer&iacute;a y VOIP, desarrollada por los hermanos Nikol&aacute;i y P&aacute;vel D&uacute;rov. La aplicaci&oacute;n est&aacute; enfocada en la mensajer&iacute;a instant&aacute;nea, el env&iacute;o de varios archivos y la comunicaci&oacute;n en masa. Se anunci&oacute; oficialmente el 14 de agosto de 2013, tiempo despu&eacute;s del autoexilio de los hermanos D&uacute;ro y antiguos compa&ntilde;eros de VK a otros pa&iacute;ses por posturas opuestas al gobierno de Rusia. A julio de 2021 una organizaci&oacute;n autofinanciada que lleva su nombre gestiona su desarrollo, cuyo centro de operaciones est&aacute; en Dub&aacute;i, Emiratos &Aacute;rabes, y su matriz est&aacute; registrada legalmente en las Islas V&iacute;rgenes Brit&aacute;nicas.<br />El servicio ofrece funcionalidades enfocadas en realizar charlas entre usuarios. Salvo excepciones, los mensajes son almacenados o archivados en caso de que se desee ocultarlos─ en la nube con opci&oacute;n de reenv&iacute;o, borrado temporizado, acciones de b&uacute;squeda, realizar llamadas y conferencias y adjuntos varios. Desde 2014 se a&ntilde;aden los adjuntos de archivos de todo tipo, ya sean documentos, multimedia o animaciones gr&aacute;ficas, con un l&iacute;mite de subida de 2 GB cada uno.4 Adem&aacute;s, para facilitar en compartir contenido colectivamente se emplean los canales de difusi&oacute;n para boletines y los grupos para discusiones, con ajustes de privacidad, p&uacute;blicos o privados, la posibilidad de compartir encuestas y la formaci&oacute;n de chats de voz sin l&iacute;mite de oyentes. La lista de contactos y permisos son gestionados en sus respectivas secciones.<br />La informaci&oacute;n es cifrada mediante la tecnolog&iacute;a MTProto en dos mecanismos. Por defecto, las conversaciones, borradores, publicaciones de grupos y canales y la lista de contactos se cifran &iacute;ntegra e independientemente v&iacute;a servidor, el formato var&iacute;a por el tipo de informaci&oacute;n&mdash; antes de sincronizar o respaldar en la nube personal; posteriormente, las claves son desgranadas y separadas por seguridad. Por otro lado est&aacute;n las llamadas, el servicio de autorellenado Passport y los &laquo;chats secretos&raquo;, exclusivos para conversaciones entre emisor y receptor, que aplican codificaci&oacute;n local entre dispositivos clientes extremo a extremo.20 La &uacute;ltima funci&oacute;n, promocionada por primera vez en el Criptoan&aacute;lisis de 2014, recibi&oacute; cr&iacute;ticas de algunos cript&oacute;grafos y activistas y ha sido conocida por ser usada por el Estado Isl&aacute;mico como herramienta para comunicar sus acciones. Como respuesta, los desarrolladores realizaron actualizaciones en la tecnolog&iacute;a para &laquo;proveer mayor privacidad y seguridad&raquo;, lema del servicio.<br />Adicionalmente, Telegram ofrece utilitarios para uso personal y colectivo. Entre ellos est&aacute; el apartado &laquo;mensajes guardados&raquo;, donde se pueden almacenar conversaciones, apuntes personales y recordatorios. Para la automatizaci&oacute;n de tareas masivas se desarrollan bots,<br />que realizan actividades y servicios extras como pagos, juegos, moderaci&oacute;n de grupos o asignaci&oacute;n de otras tareas bajo inteligencia artificial. Los bots se aplican tambi&eacute;n en el &aacute;mbito empresarial y social.<br />Inicialmente el servicio fue empleado para tel&eacute;fonos m&oacute;viles Android e iOS y el a&ntilde;o siguiente para m&uacute;ltiples plataformas: macOS, Windows, GNU/Linux, Firefox OS, navegadores web, y otras. Las aplicaciones usan la interfaz de acceso gratuito, permitiendo a los desarrolladores crear clientes externos. Parte del software est&aacute; bajo software libre &mdash;excepto el lado del servidor&mdash; y recibe el apoyo de la comunidad.<br />La aplicaci&oacute;n soporta varios idiomas. En el caso del espa&ntilde;ol para los m&oacute;viles se tradujo a principios de febrero de 2014 y para computadoras a finales del mismo a&ntilde;o, cuando Telegram aument&oacute; sorpresivamente su cuota de uso en Ir&aacute;n, Espa&ntilde;a, Rusia, Hong Kong, Brasil, Bielorrusia y otros pa&iacute;ses. Para enero de 2021 super&oacute; los quinientos millones de usuarios activos mensuales y, seg&uacute;n Sensor Tower, consigui&oacute; m&aacute;s de 63 millones de descargas de clientes m&oacute;viles en ese mes. De la misma fuente en agosto de 2021 consigui&oacute; las mil millones de descargas desde las tiendas de aplicaciones. La adaptaci&oacute;n a los cambios de dise&ntilde;o y la facilidad de uso, que ofreci&oacute; herramientas para evadir el bloqueo a la plataforma en algunos pa&iacute;ses como Rusia, consigui&oacute; que sea considerada como elemento influyente entre los medios de comunicaci&oacute;n.</p>

