<!DOCTYPE html>
<html lang="es">
<head>
  <meta name="viewport" content="width=device-width, initial-scale=1">
	<meta charset="utf-8">
	<title>portafolio web</title>
  <link href="styles.css" rel= "stylesheet">
	<link href="https://cdn.jsdelivr.net/npm/bootstrap@5.1.1/dist/css/bootstrap.min.css" rel="stylesheet" integrity="sha384-F3w7mX95PdgyTmZZMECAngseQB83DfGTowi0iMjiWaeVhAn4FJkqJByhZMI3AhiU" crossorigin="anonymous">
</head>
<body>
	
	<nav class="navbar navbar-expand-lg navbar-light bg-light">
  <div class="container-fluid">
    <a class="navbar-brand" href="#">Portafolio</a>
    <button class="navbar-toggler" type="button" data-bs-toggle="collapse" data-bs-target="#navbarNavAltMarkup" aria-controls="navbarNavAltMarkup" aria-expanded="false" aria-label="Toggle navigation">
      <span class="navbar-toggler-icon"></span>
    </button>
    <div class="collapse navbar-collapse" id="navbarNavAltMarkup">
      <div class="navbar-nav">
        <a class="nav-link active" aria-current="page" href="index.html">Home</a>
        <a class="nav-link" href="segundoparcial.html">Segundo parcial</a>
        <a class="nav-link" href="3er parcialHW.html"><b>Tercer Parcial</b></a>
      </div>
      <div class="container px-4">
  <div class="row gx-5">
    <div class="col">
     <div class="p-3 border bg-light">x</div>
    </div>
  </div>
</div>
    </div>
  </div>
</nav>
     
<a  href= tarea1p3.html class="btn btn-primary"> PDF </a>
  <h1><center>Lenguajes de programacion que mas contaminan</center></h1>

     <p><br /><span style="text-decoration: underline;"><strong>Python:</strong></span></p>
<p><br />Aunque Python sea uno de los lenguajes de programaci&oacute;n que m&aacute;s se usa hoy en d&iacute;a, algunas de las aplicaciones que trabajan con este lenguaje son las causantes de una parte de la contaminaci&oacute;n del medio ambiente, ya sea por aplicaciones como Netflix, Youtube o Spotify en las cuales sus herramientas principales son c&aacute;maras, sensores de movimiento y todos esos recursos que se usan para las pel&iacute;culas/videos y las herramientas para conexiones m&aacute;s r&aacute;pidas para sus servicios son fatales para nuestro medio ambiente. Aparte donde Spotify tiene un 14% de su energ&iacute;a que es a base de carb&oacute;n.<br />Para irnos m&aacute;s espec&iacute;ficos con Netflix, la electricidad de los centros de datos de esta plataforma proviene en un 30% del carb&oacute;n, 26% nuclear, 24% gas y solo un 17% de renovables.<br /><span style="text-decoration: underline;"><strong>C#</strong></span></p>
<p><br />Aplicaciones: Sitios y aplicaciones web, aplicaciones de escritorio, aplicaciones m&oacute;viles, desarrollo de videojuegos, entre otros.<br />Java<br />Aplicaciones: permite crear software en cualquier sitio, incluido tel&eacute;fonos m&oacute;viles, servidores, cajeros autom&aacute;ticos, terminales punto de venta, tarjetas inteligentes, televisores inteligentes, decodificadores de TV, las pasarelas del internet de las cosas, dispositivos m&eacute;dicos, autom&oacute;viles.<br /><span style="text-decoration: underline;"><strong>C++</strong></span></p>
<p><br />Aplicaciones: Navegadores web, sistemas operativos, bases de datos, bibliotecas, aplicaciones gr&aacute;ficas, nubes, videojuegos, compiladores, etc.<br /><span style="text-decoration: underline;"><strong>Lenguaje Ruby:</strong></span></p>
<p><br />Dentro de este lenguaje se pueden encontrar lo que son muchas plataformas de streaming de pel&iacute;culas, videos, emisiones en directo, etc. En esta se conoce la famosa plataforma de HULU, la cual un 29% de la energ&iacute;a que consume es a base de carb&oacute;n. Asimismo, la plataforma musical, SoundCloud, igualmente usa una gran cantidad de energ&iacute;a a base de carb&oacute;n, con un 30% de su energ&iacute;a a base de carb&oacute;n.<br />Para agregarla a la lista, la famosa red social, Twitter, la cual tambi&eacute;n contiene programaci&oacute;n en Ruby, utiliza un 21% de su energ&iacute;a a base de carb&oacute;n.n.</p>